In [1]:
import re

In [2]:
tel_number = '1234567890'
re.match(pattern='\d{10}', string = tel_number)

In [8]:
ax = re.match(pattern='\d{10}', string = tel_number)
bool(ax)

True

In [4]:
ax = re.match(pattern='\d{11}', string = tel_number)
bool(ax)

False

In [9]:
ax.start()

0

In [10]:
ax.end()

10

In [11]:
ax.span()

(0, 10)

In [14]:
ax.groups()

()

In [16]:
ax.group()

'1234567890'

In [17]:
tel_number[ax.start()]

'1'

In [18]:
tel_number[0]

'1'

In [19]:
ax.span()

(0, 10)

In [20]:
tel_num_spaces = '123 456 7890'

In [21]:
re.match(pattern='\d{3}\s\d{3}\s\d{4}', string = tel_num_spaces)

In [22]:
cnt_tel_num_space_dash = '+1 (123) 456-7890'

In [24]:
re.match(pattern='\+\d\s\(\d{3}\)\s\d{3}\-\d{4}', string = cnt_tel_num_space_dash)

In [25]:
number = '+82 (123) 456-7890'

In [26]:
re.match(pattern='\+\d{2}\s\(\d{3}\)\s\d{3}\-\d{4}', string = number)

In [27]:
rnum = '+1-202-555-0181'

In [30]:
p = re.compile('\+\d\-\d{3}\-\d{3}\-\d{4}')
p.match(rnum)

In [31]:
import pandas as pd

In [32]:
df = pd.read_csv('../data/phone.csv')

In [34]:
df

                 Phone
0        010-6256-3768
1        010.4356.3456
2  +82  (031) 539 1280
3         02-1111-2222
4        010 7657 3022
5   +82  (02) 456-4444
6          02 756 4566
7         064 245 2345

In [35]:
df = list(df['Phone'])

In [36]:
df

['010-6256-3768',
 '010.4356.3456',
 '+82  (031) 539 1280',
 '02-1111-2222',
 '010 7657 3022',
 '+82  (02) 456-4444',
 '02 756 4566',
 '064 245 2345']

In [52]:
for i in df:
    ax = re.match(pattern='(\+)?\d{2,3}[-.\s](\s\(\d{2,3}\)\s)?\d{3,4}[-.\s]\d{4}', string = str(i))
    print(i if bool(ax) else "Unmatch")

010-6256-3768
010.4356.3456
+82  (031) 539 1280
02-1111-2222
010 7657 3022
+82  (02) 456-4444
02 756 4566
064 245 2345

In [55]:
tel = []
for i in df:
    ax = re.match(pattern='(\+)?\d{2,3}[-.\s](\s\(\d{2,3}\)\s)?\d{3,4}[-.\s]\d{4}', string = str(i))
    ive = re.findall(pattern='(\+)?\d{2,3}[-.\s](\s\(\d{2,3}\)\s)?\d{3,4}[-.\s]\d{4}', string=str(i))
    tel.append(ive)
    print(i if bool(ax) else "Unmatch")

010-6256-3768
010.4356.3456
+82  (031) 539 1280
02-1111-2222
010 7657 3022
+82  (02) 456-4444
02 756 4566
064 245 2345

In [57]:
tel

[[('', '')],
 [('', '')],
 [('+', ' (031) ')],
 [('', '')],
 [('', '')],
 [('+', ' (02) ')],
 [('', '')],
 [('', '')]]

In [58]:
word = 'Layla'

In [59]:
sent = 'Layla is cute'

In [60]:
word = 'grail'
sent = 'a scratch'

In [61]:
word[0]

'g'

In [62]:
sent[0]

'a'

In [63]:
word[0:3]

'gra'

In [64]:
sent[-1]

'h'

In [65]:
word[-1]

'l'

In [67]:
sent

'a scratch'

In [68]:
sent[-9:-8]

'a'

In [69]:
sent[0:8]

'a scratc'

In [70]:
sent[0:-8]

'a'

In [71]:
sent[0:-1]

'a scratc'

In [72]:
sent[0:len(sent)]

'a scratch'

In [73]:
len(sent)

9

In [74]:
sent[2:]

'scratch'

In [75]:
word[:3]

'gra'

In [76]:
word

'grail'

In [77]:
sent[:2]

'a '

In [78]:
sent[:]

'a scratch'

In [79]:
sent[::2]

'asrth'

In [82]:
a = 'My location is 40'
b = '45\52.837'
c = '73/57'
coords = "".join([a, b, c])

In [83]:
coords

'My location is 4045*.83773/57'

In [85]:
text = """Guard: What? Ridden on a horse?
King Arthur: Yes!
Guard: What?
King Arthur: What?
Guard: You're Got coconuts[s] and you're banaglin em together
"""

In [86]:
text

"Guard: What? Ridden on a horse?\nKing Arthur: Yes!\nGuard: What?\nKing Arthur: What?\nGuard: You're Got coconuts[s] and you're banaglin em together\n"

In [87]:
text.splitlines()

['Guard: What? Ridden on a horse?',
 'King Arthur: Yes!',
 'Guard: What?',
 'King Arthur: What?',
 "Guard: You're Got coconuts[s] and you're banaglin em together"]

In [90]:
text.splitlines()[::2][0][::2]

'Gad ht idno  os?'

In [95]:
text.replace("Guard","").splitlines()[::2]

[': What? Ridden on a horse?',
 ': What?',
 ": You're Got coconuts[s] and you're banaglin em together"]

In [96]:
str(text.splitlines()[::2]).replace("Guard", '')

'[\': What? Ridden on a horse?\', \': What?\', ": You\'re Got coconuts[s] and you\'re banaglin em together"]'

In [97]:
var = 'flush wound'

In [98]:
var

'flush wound'

In [99]:
s = "IT's just a {}"
s.format(var)

"IT's just a flush wound"

In [100]:
"""Black Knight : 'Tis but a {0}.
King Arthur: A {0}? Your arm's off""".format('scratch')

"Black Knight : 'Tis but a scratch.\nKing Arthur: A scratch? Your arm's off"

In [101]:
"""Black Knight : 'Tis but a {}.
King Arthur: A {}? Your arm's off""".format('scratch', 'atsiu')

"Black Knight : 'Tis but a scratch.\nKing Arthur: A atsiu? Your arm's off"

In [102]:
"""Black Knight : 'Tis but a {0}.
King Arthur: A {1}? Your arm's off""".format('scratch', 'atsiu')

"Black Knight : 'Tis but a scratch.\nKing Arthur: A atsiu? Your arm's off"

In [104]:
code = ['45.50532789330328', '-73.570882560356s']

In [106]:
'Genshin Impact Developer Office of Canada Coddrdinates : {lat}, {lon}'.format(lat = code[0], lon = code[1])

'Genshin Impact Developer Office of Canada Coddrdinates : 45.50532789330328, -73.570882560356s'

In [107]:
'some digits of pi : {}'.format(3.14157711)

'some digits of pi : 3.14157711'

In [111]:
'In 2005 Lu Chao of China recited {:,} digitis of pi'.format(7/7890 * 10)

'In 2005 Lu Chao of China recited 0.008871989860583017 digitis of pi'

In [113]:
'나의 통장에는 {:,}원이 있다'.format(100000000)

'나의 통장에는 100,000,000원이 있다'

In [115]:
'i remember {0:4.6} or {0:.4f} of what Lu Chao recited'.format(7/67890)

'i remember 0.000103108 or 0.0001 of what Lu Chao recited'

In [116]:
'My id Code is {0:07d}'.format(12)

'My id Code is 0000012'

In [118]:
# 소수점 아래, 4번째 자리까지 출력하기
'i remember lic {0:4.6}'.format(7/67890)

'i remember lic 0.000103108'

In [121]:
'I only know %d digits of pi' % (7)

'I only know 7 digits of pi'

In [122]:
'some digits of %(cont)s : %(value).2f' % ({'cont': 'e', 'value':2.718})

'some digits of e : 2.72'

In [123]:
var = 'flesh World'
f'its just a {var}'

'its just a flesh World'

In [124]:
lat = '40.7815cN'
lon = '73.9733cW'

In [125]:
f'Hayden PlanetTarium Coodinates : {lat}, {lon}'

'Hayden PlanetTarium Coodinates : 40.7815cN, 73.9733cW'

In [126]:
import seaborn as sns

In [127]:
df = sns.load_dataset("tips")

In [128]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [129]:
df = df.sample(10)

In [130]:
df

     total_bill   tip     sex smoker   day    time  size
228       13.28  2.72    Male     No   Sat  Dinner     2
51        10.29  2.60  Female     No   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
185       20.69  5.00    Male     No   Sun  Dinner     5
158       13.39  2.61  Female     No   Sun  Dinner     2
151       13.13  2.00    Male     No   Sun  Dinner     2
178        9.60  4.00  Female    Yes   Sun  Dinner     2
172        7.25  5.15    Male    Yes   Sun  Dinner     2
175       32.90  3.11    Male    Yes   Sun  Dinner     2
225       16.27  2.50  Female    Yes   Fri   Lunch     2

In [131]:
import numpy as np

In [132]:
df.loc[np.random.permutation(df.index)[:4], 'total_bill'] = np.NAN

In [133]:
df

     total_bill   tip     sex smoker   day    time  size
228       13.28  2.72    Male     No   Sat  Dinner     2
51        10.29  2.60  Female     No   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
185         NaN  5.00    Male     No   Sun  Dinner     5
158         NaN  2.61  Female     No   Sun  Dinner     2
151         NaN  2.00    Male     No   Sun  Dinner     2
178         NaN  4.00  Female    Yes   Sun  Dinner     2
172        7.25  5.15    Male    Yes   Sun  Dinner     2
175       32.90  3.11    Male    Yes   Sun  Dinner     2
225       16.27  2.50  Female    Yes   Fri   Lunch     2

In [134]:
df.groupby('sex').count()

        total_bill  tip  smoker  day  time  size
sex
Male             4    6       6    6     6     6
Female           2    4       4    4     4     4

In [135]:
df.groupby('sex').mean()

C:\Users\starl\AppData\Local\Temp\ipykernel_45796\3838006174.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('sex').mean()

        total_bill       tip  size
sex
Male       20.4675  3.423333   2.5
Female     13.2800  2.927500   2.0

In [136]:
fill_na_mean = lambda x : x.fillna(x.mean())

In [138]:
df['sex_of_mean'] = df.groupby('sex')['total_bill'].apply(fill_na_mean)

C:\Users\starl\AppData\Local\Temp\ipykernel_45796\3256685411.py:1: FutureWarning: Not prepending group keys to the result index of transform-like apply. In the future, the group keys will be included in the index, regardless of whether the applied function returns a like-indexed object.
To preserve the previous behavior, use

	>>> .groupby(..., group_keys=False)

To adopt the future behavior and silence this warning, use

	>>> .groupby(..., group_keys=True)
  df['sex_of_mean'] = df.groupby('sex')['total_bill'].apply(fill_na_mean)

In [139]:
df

     total_bill   tip     sex smoker   day    time  size  sex_of_mean
228       13.28  2.72    Male     No   Sat  Dinner     2      13.2800
51        10.29  2.60  Female     No   Sun  Dinner     2      10.2900
192       28.44  2.56    Male    Yes  Thur   Lunch     2      28.4400
185         NaN  5.00    Male     No   Sun  Dinner     5      20.4675
158         NaN  2.61  Female     No   Sun  Dinner     2      13.2800
151         NaN  2.00    Male     No   Sun  Dinner     2      20.4675
178         NaN  4.00  Female    Yes   Sun  Dinner     2      13.2800
172        7.25  5.15    Male    Yes   Sun  Dinner     2       7.2500
175       32.90  3.11    Male    Yes   Sun  Dinner     2      32.9000
225       16.27  2.50  Female    Yes   Fri   Lunch     2      16.2700

In [140]:
df['sex_of_mean'] = df.groupby('sex')['total_bill'].transform(fill_na_mean)
df

     total_bill   tip     sex smoker   day    time  size  sex_of_mean
228       13.28  2.72    Male     No   Sat  Dinner     2      13.2800
51        10.29  2.60  Female     No   Sun  Dinner     2      10.2900
192       28.44  2.56    Male    Yes  Thur   Lunch     2      28.4400
185         NaN  5.00    Male     No   Sun  Dinner     5      20.4675
158         NaN  2.61  Female     No   Sun  Dinner     2      13.2800
151         NaN  2.00    Male     No   Sun  Dinner     2      20.4675
178         NaN  4.00  Female    Yes   Sun  Dinner     2      13.2800
172        7.25  5.15    Male    Yes   Sun  Dinner     2       7.2500
175       32.90  3.11    Male    Yes   Sun  Dinner     2      32.9000
225       16.27  2.50  Female    Yes   Fri   Lunch     2      16.2700

In [141]:
df = sns.load_dataset("tips")

In [142]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [143]:
df['size'].value_counts()

2    156
3     38
4     37
5      5
1      4
6      4
Name: size, dtype: int64

In [145]:
df.groupby('size').filter(lambda x : x['size'].count() >= 30)['size'].value_counts()

2    156
3     38
4     37
Name: size, dtype: int64

In [147]:
tips10 = sns.load_dataset("tips").sample(10, random_state = 42)

In [148]:
tips10

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176       17.89  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [157]:
grouped = df.groupby('sex')
print(type(grouped))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [158]:
grouped

In [159]:
type(grouped)

pandas.core.groupby.generic.DataFrameGroupBy

In [160]:
grouped.groups

{'Male': [1, 2, 3, 5, 6, 7, 8, 9, 10, 12, 13, 15, 17, 19, 20, 23, 24, 25, 26, 27, 28, 30, 31, 34, 35, 36, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 53, 54, 55, 56, 58, 59, 60, 61, 62, 63, 64, 65, 68, 69, 70, 75, 76, 77, 78, 79, 80, 81, 83, 84, 86, 87, 88, 89, 90, 91, 95, 96, 97, 98, 99, 105, 106, 107, 108, 110, 112, 113, 116, 120, 122, 123, 126, 129, 130, 138, 141, 142, 148, 149, 150, 151, 152, 153, 154, 156, 159, ...], 'Female': [0, 4, 11, 14, 16, 18, 21, 22, 29, 32, 33, 37, 51, 52, 57, 66, 67, 71, 72, 73, 74, 82, 85, 92, 93, 94, 100, 101, 102, 103, 104, 109, 111, 114, 115, 117, 118, 119, 121, 124, 125, 127, 128, 131, 132, 133, 134, 135, 136, 137, 139, 140, 143, 144, 145, 146, 147, 155, 157, 158, 162, 164, 168, 169, 178, 186, 188, 191, 197, 198, 201, 202, 203, 205, 209, 213, 214, 215, 219, 221, 223, 225, 226, 229, 238, 240, 243]}

In [161]:
grouped.mean()

C:\Users\starl\AppData\Local\Temp\ipykernel_45796\2755795945.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grouped.mean()

        total_bill       tip      size
sex
Male     20.744076  3.089618  2.630573
Female   18.056897  2.833448  2.459770

In [162]:
grouped.get_group('Female')

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
11        35.26  5.00  Female     No   Sun  Dinner     4
14        14.83  3.02  Female     No   Sun  Dinner     2
16        10.33  1.67  Female     No   Sun  Dinner     3
..          ...   ...     ...    ...   ...     ...   ...
226       10.09  2.00  Female    Yes   Fri   Lunch     2
229       22.12  2.88  Female    Yes   Sat  Dinner     2
238       35.83  4.67  Female     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[87 rows x 7 columns]

In [163]:
# get group는 그룹된 객체에서만 사용할 수 있고, 해당 그룹을 추출하는 기법

In [165]:
for i in grouped:
    print(f'group type of {type(i)}')
    print(f"group length is {len(i)}")
    print(f"group name is {i[0]}")

group type of <class 'tuple'>
group length is 2
group name is Male
group type of <class 'tuple'>
group length is 2
group name is Female

In [166]:
import datetime

In [167]:
t1 = datetime.datetime.now()

In [168]:
t1

datetime.datetime(2023, 12, 13, 21, 47, 31, 437815)

In [169]:
print(t1)

2023-12-13 21:47:31.437815

In [170]:
t2 = datetime.datetime(1970, 1,1 )

In [171]:
print(t2)

1970-01-01 00:00:00

In [172]:
t3 = datetime.datetime(1970, 12, 12, 13, 24, 34)

In [173]:
print(t3)

1970-12-12 13:24:34

In [176]:
print(datetime.datetime(2023,11,22, 9, 53, 32, 685342))
print(datetime.datetime(1970,1,1))
print(datetime.datetime(1970, 12, 12, 13, 24, 34))

2023-11-22 09:53:32.685342
1970-01-01 00:00:00
1970-12-12 13:24:34

In [177]:
now = datetime.datetime.now()

In [178]:
print(now)

2023-12-13 21:52:30.738328

In [179]:
now.strftime('%Y-%d-%m')

'2023-13-12'

In [180]:
now.strftime('%Y:%d:%m')

'2023:13:12'

In [181]:
now.strftime('%Y-%m-%d %H:%M:%S')

'2023-12-13 21:52:30'

In [182]:
df = pd.read_csv('../data/country_timeseries.csv', parse_dates=['Date'])

In [183]:
df

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,2015-01-05,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,2015-01-04,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,2015-01-03,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,2015-01-02,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,2014-12-31,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
117,2014-03-27,5,103.0,8.0,6.0,NaN,NaN,NaN,NaN,NaN,66.0,6.0,5.0,NaN,NaN,NaN,NaN,NaN
118,2014-03-26,4,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,62.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119,2014-03-25,3,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,60.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
120,2014-03-24,2,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,59.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
121,2014-03-22,0,49.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,29.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [184]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    datetime64[ns]
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
dtypes: datetime64[ns](1), float64(16), int64(1)
memory usage: 17.3 KB

In [185]:
date_series = pd.Series([
    '2018-05-06', '2018-05-17', '2018-05-18'
])

In [186]:
date_series

0    2018-05-06
1    2018-05-17
2    2018-05-18
dtype: object

In [187]:
d1 = pd.to_datetime(date_series)

In [188]:
type(d1)

pandas.core.series.Series

In [189]:
d1

0   2018-05-06
1   2018-05-17
2   2018-05-18
dtype: datetime64[ns]

In [190]:
d1.dt.year

0    2018
1    2018
2    2018
dtype: int64

In [191]:
d1.dt.month

0    5
1    5
2    5
dtype: int64

In [192]:
d1.dt.day

0     6
1    17
2    18
dtype: int64

In [194]:
d1[0].year

2018

In [195]:
d1[0].month

5

In [196]:
d1[0].day

6

In [197]:
df

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,2015-01-05,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,2015-01-04,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,2015-01-03,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,2015-01-02,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,2014-12-31,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
117,2014-03-27,5,103.0,8.0,6.0,NaN,NaN,NaN,NaN,NaN,66.0,6.0,5.0,NaN,NaN,NaN,NaN,NaN
118,2014-03-26,4,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,62.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119,2014-03-25,3,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,60.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
120,2014-03-24,2,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,59.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
121,2014-03-22,0,49.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,29.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [198]:
df['year'], df['month'], df['day'] = df.Date.dt.year, df.Date.dt.month, df.Date.dt.day

In [199]:
df[['Date','year','month','day']]

          Date  year  month  day
0   2015-01-05  2015      1    5
1   2015-01-04  2015      1    4
2   2015-01-03  2015      1    3
3   2015-01-02  2015      1    2
4   2014-12-31  2014     12   31
..         ...   ...    ...  ...
117 2014-03-27  2014      3   27
118 2014-03-26  2014      3   26
119 2014-03-25  2014      3   25
120 2014-03-24  2014      3   24
121 2014-03-22  2014      3   22

[122 rows x 4 columns]

In [201]:
df.columns

Index(['Date', 'Day', 'Cases_Guinea', 'Cases_Liberia', 'Cases_SierraLeone',
       'Cases_Nigeria', 'Cases_Senegal', 'Cases_UnitedStates', 'Cases_Spain',
       'Cases_Mali', 'Deaths_Guinea', 'Deaths_Liberia', 'Deaths_SierraLeone',
       'Deaths_Nigeria', 'Deaths_Senegal', 'Deaths_UnitedStates',
       'Deaths_Spain', 'Deaths_Mali', 'year', 'month', 'day'],
      dtype='object')

In [205]:
df.index = df['Date']

In [207]:
df.loc[0:, ['Cases_Guinea', 'Cases_Liberia', 'Cases_SierraLeone',
       'Cases_Nigeria', 'Cases_Senegal', 'Cases_UnitedStates', 'Cases_Spain',
       'Cases_Mali', 'Deaths_Guinea', 'Deaths_Liberia', 'Deaths_SierraLeone',
       'Deaths_Nigeria', 'Deaths_Senegal', 'Deaths_UnitedStates',
       'Deaths_Spain', 'Deaths_Mali']].plot()

TypeError: cannot do slice indexing on DatetimeIndex with these indexers [0] of type int

In [208]:
df.info9

AttributeError: 'DataFrame' object has no attribute 'info9'

In [209]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 122 entries, 2015-01-05 to 2014-03-22
Data columns (total 21 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    datetime64[ns]
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
 18  year                 122 non-null    int64
 19  month                122 non-null    int64
 20  day                  122 non-null    int64
dtypes: datetime64[ns](1), float64(16), int64(4)
memory usage: 21.0 KB

In [210]:
df

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,...,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali,year,month,day
Date,,,,,,,,,,,,,,,,,,,,,
2015-01-05,2015-01-05,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,...,NaN,2977.0,NaN,NaN,NaN,NaN,NaN,2015,1,5
2015-01-04,2015-01-04,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,...,NaN,2943.0,NaN,NaN,NaN,NaN,NaN,2015,1,4
2015-01-03,2015-01-03,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,...,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN,2015,1,3
2015-01-02,2015-01-02,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,...,3496.0,NaN,NaN,NaN,NaN,NaN,NaN,2015,1,2
2014-12-31,2014-12-31,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,...,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN,2014,12,31
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2014-03-27,2014-03-27,5,103.0,8.0,6.0,NaN,NaN,NaN,NaN,NaN,...,6.0,5.0,NaN,NaN,NaN,NaN,NaN,2014,3,27
2014-03-26,2014-03-26,4,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2014,3,26
2014-03-25,2014-03-25,3,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2014,3,25
2014-03-24,2014-03-24,2,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2014,3,24
2014-03-22,2014-03-22,0,49.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2014,3,22